{"backend": "tensorflow", "config": {"output_layers": [["lambda_1", 0, 0]], "layers": [{"name": "input_1", "inbound_nodes": [], "config": {"dtype": "float32", "name": "input_1", "batch_input_shape": [null, 300, 300, 3], "sparse": false}, "class_name": "InputLayer"}, {"name": "model_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"output_layers": [["leaky_re_lu_8", 0, 0]], "layers": [{"name": "input_3", "inbound_nodes": [], "config": {"dtype": "float32", "name": "input_3", "batch_input_shape": [null, 300, 300, 3], "sparse": false}, "class_name": "InputLayer"}, {"name": "conv_1", "inbound_nodes": [[["input_3", 0, 0, {}]]], "config": {"strides": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "padding": "same", "name": "conv_1", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null, "dilation_rate": [1, 1], "filters": 16, "use_bias": false}, "class_name": "Conv2D"}, {"name": "norm_1", "inbound_nodes": [[["conv_1", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_regularizer": null, "center": true, "trainable": true, "momentum": 0.99, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "norm_1", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"name": "leaky_re_lu_1", "inbound_nodes": [[["norm_1", 0, 0, {}]]], "config": {"trainable": true, "name": "leaky_re_lu_1", "alpha": 0.10000000149011612}, "class_name": "LeakyReLU"}, {"name": "max_pooling2d_1", "inbound_nodes": [[["leaky_re_lu_1", 0, 0, {}]]], "config": {"strides": [2, 2], "pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "padding": "valid", "name": "max_pooling2d_1"}, "class_name": "MaxPooling2D"}, {"name": "conv_2", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"strides": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "padding": "same", "name": "conv_2", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null, "dilation_rate": [1, 1], "filters": 32, "use_bias": false}, "class_name": "Conv2D"}, {"name": "norm_2", "inbound_nodes": [[["conv_2", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_regularizer": null, "center": true, "trainable": true, "momentum": 0.99, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "norm_2", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"name": "leaky_re_lu_2", "inbound_nodes": [[["norm_2", 0, 0, {}]]], "config": {"trainable": true, "name": "leaky_re_lu_2", "alpha": 0.10000000149011612}, "class_name": "LeakyReLU"}, {"name": "max_pooling2d_2", "inbound_nodes": [[["leaky_re_lu_2", 0, 0, {}]]], "config": {"strides": [2, 2], "pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "padding": "valid", "name": "max_pooling2d_2"}, "class_name": "MaxPooling2D"}, {"name": "conv_3", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"strides": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "padding": "same", "name": "conv_3", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null, "dilation_rate": [1, 1], "filters": 64, "use_bias": false}, "class_name": "Conv2D"}, {"name": "norm_3", "inbound_nodes": [[["conv_3", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_regularizer": null, "center": true, "trainable": true, "momentum": 0.99, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "norm_3", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"name": "leaky_re_lu_3", "inbound_nodes": [[["norm_3", 0, 0, {}]]], "config": {"trainable": true, "name": "leaky_re_lu_3", "alpha": 0.10000000149011612}, "class_name": "LeakyReLU"}, {"name": "max_pooling2d_3", "inbound_nodes": [[["leaky_re_lu_3", 0, 0, {}]]], "config": {"strides": [2, 2], "pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "padding": "valid", "name": "max_pooling2d_3"}, "class_name": "MaxPooling2D"}, {"name": "conv_4", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "config": {"strides": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "padding": "same", "name": "conv_4", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null, "dilation_rate": [1, 1], "filters": 128, "use_bias": false}, "class_name": "Conv2D"}, {"name": "norm_4", "inbound_nodes": [[["conv_4", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_regularizer": null, "center": true, "trainable": true, "momentum": 0.99, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "norm_4", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"name": "leaky_re_lu_4", "inbound_nodes": [[["norm_4", 0, 0, {}]]], "config": {"trainable": true, "name": "leaky_re_lu_4", "alpha": 0.10000000149011612}, "class_name": "LeakyReLU"}, {"name": "max_pooling2d_4", "inbound_nodes": [[["leaky_re_lu_4", 0, 0, {}]]], "config": {"strides": [2, 2], "pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "padding": "valid", "name": "max_pooling2d_4"}, "class_name": "MaxPooling2D"}, {"name": "conv_5", "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]], "config": {"strides": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "padding": "same", "name": "conv_5", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null, "dilation_rate": [1, 1], "filters": 256, "use_bias": false}, "class_name": "Conv2D"}, {"name": "norm_5", "inbound_nodes": [[["conv_5", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_regularizer": null, "center": true, "trainable": true, "momentum": 0.99, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "norm_5", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"name": "leaky_re_lu_5", "inbound_nodes": [[["norm_5", 0, 0, {}]]], "config": {"trainable": true, "name": "leaky_re_lu_5", "alpha": 0.10000000149011612}, "class_name": "LeakyReLU"}, {"name": "max_pooling2d_5", "inbound_nodes": [[["leaky_re_lu_5", 0, 0, {}]]], "config": {"strides": [2, 2], "pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "padding": "valid", "name": "max_pooling2d_5"}, "class_name": "MaxPooling2D"}, {"name": "conv_6", "inbound_nodes": [[["max_pooling2d_5", 0, 0, {}]]], "config": {"strides": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "padding": "same", "name": "conv_6", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null, "dilation_rate": [1, 1], "filters": 512, "use_bias": false}, "class_name": "Conv2D"}, {"name": "norm_6", "inbound_nodes": [[["conv_6", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_regularizer": null, "center": true, "trainable": true, "momentum": 0.99, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "norm_6", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"name": "leaky_re_lu_6", "inbound_nodes": [[["norm_6", 0, 0, {}]]], "config": {"trainable": true, "name": "leaky_re_lu_6", "alpha": 0.10000000149011612}, "class_name": "LeakyReLU"}, {"name": "max_pooling2d_6", "inbound_nodes": [[["leaky_re_lu_6", 0, 0, {}]]], "config": {"strides": [1, 1], "pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "padding": "same", "name": "max_pooling2d_6"}, "class_name": "MaxPooling2D"}, {"name": "conv_7", "inbound_nodes": [[["max_pooling2d_6", 0, 0, {}]]], "config": {"strides": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "padding": "same", "name": "conv_7", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null, "dilation_rate": [1, 1], "filters": 1024, "use_bias": false}, "class_name": "Conv2D"}, {"name": "norm_7", "inbound_nodes": [[["conv_7", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_regularizer": null, "center": true, "trainable": true, "momentum": 0.99, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "norm_7", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"name": "leaky_re_lu_7", "inbound_nodes": [[["norm_7", 0, 0, {}]]], "config": {"trainable": true, "name": "leaky_re_lu_7", "alpha": 0.10000000149011612}, "class_name": "LeakyReLU"}, {"name": "conv_8", "inbound_nodes": [[["leaky_re_lu_7", 0, 0, {}]]], "config": {"strides": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "padding": "same", "name": "conv_8", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null, "dilation_rate": [1, 1], "filters": 1024, "use_bias": false}, "class_name": "Conv2D"}, {"name": "norm_8", "inbound_nodes": [[["conv_8", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_regularizer": null, "center": true, "trainable": true, "momentum": 0.99, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "norm_8", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "axis": -1, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"name": "leaky_re_lu_8", "inbound_nodes": [[["norm_8", 0, 0, {}]]], "config": {"trainable": true, "name": "leaky_re_lu_8", "alpha": 0.10000000149011612}, "class_name": "LeakyReLU"}], "name": "model_1", "input_layers": [["input_3", 0, 0]]}, "class_name": "Model"}, {"name": "DetectionLayer", "inbound_nodes": [[["model_1", 1, 0, {}]]], "config": {"strides": [1, 1], "bias_constraint": null, "kernel_size": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "dilation_rate": [1, 1], "name": "DetectionLayer", "kernel_initializer": {"config": {"distribution": "normal", "seed": null, "scale": 1.0, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null, "padding": "same", "filters": 40, "use_bias": true}, "class_name": "Conv2D"}, {"name": "reshape_1", "inbound_nodes": [[["DetectionLayer", 0, 0, {}]]], "config": {"trainable": true, "name": "reshape_1", "target_shape": [9, 9, 5, 8]}, "class_name": "Reshape"}, {"name": "input_2", "inbound_nodes": [], "config": {"dtype": "float32", "name": "input_2", "batch_input_shape": [null, 1, 1, 1, 2, 4], "sparse": false}, "class_name": "InputLayer"}, {"name": "lambda_1", "inbound_nodes": [[["reshape_1", 0, 0, {}], ["input_2", 0, 0, {}]]], "config": {"name": "lambda_1", "output_shape": null, "function": ["4wEAAAAAAAAAAQAAAAIAAABTAAAAcwgAAAB8AABkAQAZUykCTukAAAAAqQApAdoEYXJnc3ICAAAA\ncgIAAAD6Ri9ob21lL3ZpYmxvdGVhbS9Qcm9qZWN0L3RhYmJ5X3NlYXJjaC95b2xvX29iamVjdF9k\nZXRlY3Rpb24vZnJvbnRlbmQucHnaCDxsYW1iZGE+OQAAAPMAAAAA\n", null, null], "trainable": true, "arguments": {}, "function_type": "lambda", "output_shape_type": "raw"}, "class_name": "Lambda"}], "name": "model_2", "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]]}, "class_name": "Model", "keras_version": "2.1.4"}