{"config": {"name": "model_2", "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "output_layers": [["lambda_1", 0, 0]], "layers": [{"name": "input_1", "inbound_nodes": [], "class_name": "InputLayer", "config": {"dtype": "float32", "sparse": false, "name": "input_1", "batch_input_shape": [null, 300, 300, 3]}}, {"name": "model_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Model", "config": {"input_layers": [["input_3", 0, 0]], "name": "model_1", "output_layers": [["leaky_re_lu_8", 0, 0]], "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_3", "config": {"dtype": "float32", "sparse": false, "name": "input_3", "batch_input_shape": [null, 300, 300, 3]}}, {"class_name": "Conv2D", "inbound_nodes": [[["input_3", 0, 0, {}]]], "name": "conv_1", "config": {"bias_constraint": null, "name": "conv_1", "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 16, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true, "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "activation": "linear", "use_bias": false}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_1", 0, 0, {}]]], "name": "norm_1", "config": {"name": "norm_1", "epsilon": 0.001, "scale": true, "trainable": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "center": true, "beta_constraint": null, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "gamma_constraint": null}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["norm_1", 0, 0, {}]]], "name": "leaky_re_lu_1", "config": {"trainable": true, "alpha": 0.10000000149011612, "name": "leaky_re_lu_1"}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["leaky_re_lu_1", 0, 0, {}]]], "name": "max_pooling2d_1", "config": {"strides": [2, 2], "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_1", "padding": "valid", "data_format": "channels_last"}}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "name": "conv_2", "config": {"bias_constraint": null, "name": "conv_2", "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true, "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "activation": "linear", "use_bias": false}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_2", 0, 0, {}]]], "name": "norm_2", "config": {"name": "norm_2", "epsilon": 0.001, "scale": true, "trainable": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "center": true, "beta_constraint": null, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "gamma_constraint": null}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["norm_2", 0, 0, {}]]], "name": "leaky_re_lu_2", "config": {"trainable": true, "alpha": 0.10000000149011612, "name": "leaky_re_lu_2"}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["leaky_re_lu_2", 0, 0, {}]]], "name": "max_pooling2d_2", "config": {"strides": [2, 2], "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_2", "padding": "valid", "data_format": "channels_last"}}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "name": "conv_3", "config": {"bias_constraint": null, "name": "conv_3", "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true, "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "activation": "linear", "use_bias": false}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_3", 0, 0, {}]]], "name": "norm_3", "config": {"name": "norm_3", "epsilon": 0.001, "scale": true, "trainable": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "center": true, "beta_constraint": null, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "gamma_constraint": null}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["norm_3", 0, 0, {}]]], "name": "leaky_re_lu_3", "config": {"trainable": true, "alpha": 0.10000000149011612, "name": "leaky_re_lu_3"}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["leaky_re_lu_3", 0, 0, {}]]], "name": "max_pooling2d_3", "config": {"strides": [2, 2], "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_3", "padding": "valid", "data_format": "channels_last"}}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "name": "conv_4", "config": {"bias_constraint": null, "name": "conv_4", "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true, "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "activation": "linear", "use_bias": false}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_4", 0, 0, {}]]], "name": "norm_4", "config": {"name": "norm_4", "epsilon": 0.001, "scale": true, "trainable": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "center": true, "beta_constraint": null, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "gamma_constraint": null}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["norm_4", 0, 0, {}]]], "name": "leaky_re_lu_4", "config": {"trainable": true, "alpha": 0.10000000149011612, "name": "leaky_re_lu_4"}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["leaky_re_lu_4", 0, 0, {}]]], "name": "max_pooling2d_4", "config": {"strides": [2, 2], "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_4", "padding": "valid", "data_format": "channels_last"}}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]], "name": "conv_5", "config": {"bias_constraint": null, "name": "conv_5", "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 256, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true, "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "activation": "linear", "use_bias": false}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_5", 0, 0, {}]]], "name": "norm_5", "config": {"name": "norm_5", "epsilon": 0.001, "scale": true, "trainable": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "center": true, "beta_constraint": null, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "gamma_constraint": null}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["norm_5", 0, 0, {}]]], "name": "leaky_re_lu_5", "config": {"trainable": true, "alpha": 0.10000000149011612, "name": "leaky_re_lu_5"}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["leaky_re_lu_5", 0, 0, {}]]], "name": "max_pooling2d_5", "config": {"strides": [2, 2], "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_5", "padding": "valid", "data_format": "channels_last"}}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_5", 0, 0, {}]]], "name": "conv_6", "config": {"bias_constraint": null, "name": "conv_6", "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 512, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true, "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "activation": "linear", "use_bias": false}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_6", 0, 0, {}]]], "name": "norm_6", "config": {"name": "norm_6", "epsilon": 0.001, "scale": true, "trainable": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "center": true, "beta_constraint": null, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "gamma_constraint": null}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["norm_6", 0, 0, {}]]], "name": "leaky_re_lu_6", "config": {"trainable": true, "alpha": 0.10000000149011612, "name": "leaky_re_lu_6"}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["leaky_re_lu_6", 0, 0, {}]]], "name": "max_pooling2d_6", "config": {"strides": [1, 1], "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_6", "padding": "same", "data_format": "channels_last"}}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_6", 0, 0, {}]]], "name": "conv_7", "config": {"bias_constraint": null, "name": "conv_7", "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 1024, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true, "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "activation": "linear", "use_bias": false}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_7", 0, 0, {}]]], "name": "norm_7", "config": {"name": "norm_7", "epsilon": 0.001, "scale": true, "trainable": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "center": true, "beta_constraint": null, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "gamma_constraint": null}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["norm_7", 0, 0, {}]]], "name": "leaky_re_lu_7", "config": {"trainable": true, "alpha": 0.10000000149011612, "name": "leaky_re_lu_7"}}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_7", 0, 0, {}]]], "name": "conv_8", "config": {"bias_constraint": null, "name": "conv_8", "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 1024, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true, "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "activation": "linear", "use_bias": false}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_8", 0, 0, {}]]], "name": "norm_8", "config": {"name": "norm_8", "epsilon": 0.001, "scale": true, "trainable": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "center": true, "beta_constraint": null, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "gamma_constraint": null}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["norm_8", 0, 0, {}]]], "name": "leaky_re_lu_8", "config": {"trainable": true, "alpha": 0.10000000149011612, "name": "leaky_re_lu_8"}}]}}, {"name": "DetectionLayer", "inbound_nodes": [[["model_1", 1, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "use_bias": true, "name": "DetectionLayer", "kernel_regularizer": null, "trainable": true, "filters": 40, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_initializer": {"config": {"distribution": "normal", "scale": 1.0, "seed": null, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "kernel_size": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "activation": "linear", "padding": "same"}}, {"name": "reshape_1", "inbound_nodes": [[["DetectionLayer", 0, 0, {}]]], "class_name": "Reshape", "config": {"trainable": true, "target_shape": [9, 9, 5, 8], "name": "reshape_1"}}, {"name": "input_2", "inbound_nodes": [], "class_name": "InputLayer", "config": {"dtype": "float32", "sparse": false, "name": "input_2", "batch_input_shape": [null, 1, 1, 1, 2, 4]}}, {"name": "lambda_1", "inbound_nodes": [[["reshape_1", 0, 0, {}], ["input_2", 0, 0, {}]]], "class_name": "Lambda", "config": {"trainable": true, "name": "lambda_1", "function_type": "lambda", "arguments": {}, "function": ["4wEAAAAAAAAAAQAAAAIAAABTAAAAcwgAAAB8AABkAQAZUykCTukAAAAAqQApAdoEYXJnc3ICAAAA\ncgIAAAD6Ri9ob21lL3ZpYmxvdGVhbS9Qcm9qZWN0L3RhYmJ5X3NlYXJjaC95b2xvX29iamVjdF9k\nZXRlY3Rpb24vZnJvbnRlbmQucHnaCDxsYW1iZGE+OQAAAPMAAAAA\n", null, null], "output_shape": null, "output_shape_type": "raw"}}]}, "class_name": "Model", "backend": "tensorflow", "keras_version": "2.1.4"}